[
    {
        "id":"01",
        "books_image":"https://i.ibb.co/3hdmtBM/download-17.jpg",
        "books_name":"Himu",
        "author_name":"Humayun Ahmed",
        "category":"Novel",
        "Rating":"9/10",
        "details":"Himu wears a yellow panjabi that does not have a pocket and lives a mostly nomadic life. He walks barefoot on the streets of Dhaka without a certain destination. He does not have a job and, therefore, no source of income. He prefers the life of a beggar to that of a hard worker, often praising begging. The charterer is decidedly eccentric and unorthodox in outlook. He has a large number of followers for his spiritual power of predicting future events of anyone, including those of police officers, beggars, neighbors, relatives, and tea stall proprietors. Most of the time he indifferently speaks unpleasant truth about the person with whom he talks. Himu unlike the atheist psychology Professor Misir Ali argues that the beliefs make things happen, not inspecting or asking questions. This aspect of him makes him a person who lives by the magical side of the world, not using logic.",
        "num_of_page": "311",
        "publisher": "1972"
    },
    {
        "id":"02",
        "books_image":"https://i.ibb.co/dDf9XzH/download-24.jpg","books_name":"Durgo Rahasya",
        "author_name":"Satyajit Ray",
        "category":"Thriller",
        "Rating":"8/10",
        "details":"Durgo Rahasya is a Bengali mystery novel written by Satyajit Ray, the acclaimed filmmaker and author. It is part of his popular 'Feluda' series, featuring the adventures of the detective Pradosh Chandra Mitter, commonly known as Feluda, and his companions, Topshe and Jatayu. In 'Durgo Rahasya,' Feluda is approached by a wealthy businessman named Mahavir Kanodia, who seeks his help in locating a missing gold statuette of the goddess Durga. The statuette, known as the 'Goyenda' (The Detective), is a family heirloom and holds great sentimental value for Kanodia. It was stolen from his private collection, and he suspects that one of his relatives may be involved in the theft. As Feluda begins his investigation, he unravels a web of deceit, jealousy, and betrayal within the Kanodia family. The novel takes readers on a thrilling journey through the streets of Kolkata, as Feluda and his companions follow clues, interview suspects, and piece together the puzzle of the missing statuette.",
        "num_of_page": "282",
        "publisher": "1952"
    },
    {
        "id":"03",
        "books_image":"https://i.ibb.co/BGtgqJc/download-23.jpg","books_name":"Pather Panchali",
        "author_name":"Bibhutibhushan Bandopadhyay",
        "category":"Novel",
        "Rating":"9/10",
        "details":"Pather Panchali is a Bengali novel written by Bibhutibhushan Bandopadhyay, first published in 1929. It is the first part of the 'Apu Trilogy,' which also includes 'Aparajito' and 'Apur Sansar.' The novel is widely regarded as a masterpiece of Bengali literature and has been translated into numerous languages. The story revolves around the life of a young boy named Apu, who grows up in a rural village in Bengal. The novel vividly depicts the sights, sounds, and struggles of village life during the early 20th century. Through the eyes of Apu, readers experience the joys and sorrows, the beauty and harshness, of rural existence. Pather Panchali is celebrated for its lyrical prose, evocative descriptions, and deep emotional resonance. It offers a poignant portrayal of the human experience, touching upon universal themes that resonate with readers across cultures and generations.",
        "num_of_page": "351",
        "publisher": "1955"
    },
    {
        "id":"04",
        "books_image":"https://i.ibb.co/7tvPGDQ/images-4.jpg",    "books_name":"Nirbachita Bhuter Galpo",
        "author_name":"Humayun Ahmed",
        "category":"Thriller",
        "Rating":"7.5/10",
        "details":"Nirbachita Bhuter Galpo is a collection of Bengali short stories that delve into the realm of the supernatural and the paranormal. Edited by Sunil Gangopadhyay, a renowned Bengali author, poet, and literary giant, this anthology brings together tales from various authors, each offering a unique perspective on ghosts, spirits, and otherworldly phenomena. The stories in 'Nirbachita Bhuter Galpo' are characterized by their atmospheric settings, eerie encounters, and imaginative storytelling. They explore themes of fear, mystery, and the unknown, inviting readers to suspend disbelief and journey into the realms of the supernatural. Some stories may feature traditional Bengali folklore and legends, while others offer contemporary interpretations of ghostly encounters in modern settings. From haunted houses to cursed objects, from vengeful spirits to benevolent ghosts, the anthology presents a diverse range of supernatural elements that captivate and chill the reader.",
        "num_of_page": "191",
        "publisher": "1990"
    },
    {
        "id":"05",
        "books_image":"https://i.ibb.co/TgpMvGt/images-3.jpg",
        "books_name":"The Ottoman Centuries: The Rise and Fall of the Turkish Empire",
        "author_name":"Lord Kinross",
        "category":"History",
        "Rating":"9.5/10",
        "details":"The Ottoman Centuries: The Rise and Fall of the Turkish Empire is a seminal work by Lord Kinross that provides a comprehensive overview of the history of the Ottoman Empire. First published in 1977, it remains one of the most widely acclaimed and authoritative books on the subject. Lord Kinross traces the story of the Ottoman Empire from its humble beginnings in the 13th century to its eventual dissolution in the aftermath of World War I. The book chronicles the empire's rise to power under the leadership of Osman I and his successors, exploring the expansion of Ottoman territory, the establishment of a vast multiethnic state, and the consolidation of imperial authority. The Ottoman Centuries is praised for its engaging prose, meticulous research, and balanced perspective on one of the most influential empires in history. It offers readers a comprehensive understanding of the rise and fall of the Ottoman Empire, as well as its lasting legacy in the modern world.",
        "num_of_page": "555",
        "publisher": "1985"
    },
    {
        "id":"06",
        "books_image":"https://i.ibb.co/bXLkmNp/download-20.jpg","books_name":"Shesh Bikeler Meye",
        "author_name":"Jahir Rayhan",
        "category":"Novel","Rating":"8/10",
        "details":"Shesh Bikeler Meye is a classic Bengali novel written by Jahir Rayhan. The title translates to 'The Girl of the Last Afternoon' in English. Set against the backdrop of rural Bengal, the novel tells the story of a young girl named Shefali and her experiences as she navigates the complexities of life in her village. The narrative unfolds through the perspective of Shefali, offering readers a glimpse into her world and the challenges she faces growing up in a traditional Bengali society. Shefali's coming-of-age journey is marked by her interactions with various characters, including her family members, neighbors, and acquaintances, each of whom leaves an indelible impact on her life. As Shefali grapples with the expectations and limitations imposed upon her by societal norms, she also yearns for freedom, independence, and self-expression. Through her dreams, aspirations, and struggles, the novel explores themes of identity, gender roles, social dynamics, and the pursuit of individuality in a conservative environment. 'Shesh Bikeler Meye' is praised for its evocative portrayal of rural life in Bengal, its nuanced characterization, and its insightful exploration of the human condition. Jahir Rayhan's vivid descriptions, rich imagery, and lyrical prose bring the setting and characters to life, immersing readers in Shefali's world and inviting them to empathize with her joys and sorrows.",
        "num_of_page": "180",
        "publisher": "1970"
    },
    {
        "id":"07",
        "books_image":"https://i.ibb.co/r7YpL54/download-18.jpg","books_name":"The Janissary Tree",
        "author_name":"Jason Goodwin",
        "category":"History",
        "Rating":"7/10",
        "details":"The Janissary Tree is the first book in the 'Yashim the Eunuch' series written by Jason Goodwin. Set in 19th-century Istanbul, this historical mystery novel follows the adventures of Yashim, a eunuch and investigator, as he navigates the complex and vibrant world of the Ottoman Empire. The story begins with the discovery of a series of brutal murders in Istanbul's palace district. As the bodies pile up, Sultan Mahmud II calls upon Yashim, a trusted servant and former member of the Janissaries, to discreetly investigate the crimes. Yashim, with his keen intellect, sharp wit, and deep knowledge of the city's secrets, soon finds himself embroiled in a dangerous conspiracy that threatens to destabilize the empire. As Yashim delves deeper into the mystery, he encounters a cast of intriguing characters, including a seductive Polish countess, a scheming Georgian prince, and a mysterious French archaeologist. Along the way, he must navigate the labyrinthine streets of Istanbul, unraveling clues and piecing together the puzzle of the murders while contending with political intrigue, religious tensions, and personal demons from his past.",
        "num_of_page": "378",
        "publisher": "1999"
    },
    {
        "id":"08",
        "books_image":"https://i.ibb.co/NKM97hg/download-19.jpg",    "books_name":"Project Nebula",
        "author_name":"Mohammad Jafor Iqbal",
        "category":"Sci-Fi",
        "Rating":"8/10",
        "details":"Project Nebula is a science fiction novel written by Muhammed Zafar Iqbal, one of Bangladesh's most prominent authors in the genre. This novel takes readers on a thrilling journey into the depths of space, exploring distant planets, encountering alien life forms, and grappling with the mysteries of the universe. The story revolves around a group of astronauts who embark on an ambitious mission known as 'Project Nebula.' Their goal is to explore a newly discovered nebula located in a distant galaxy, which is believed to hold the key to unlocking the secrets of the cosmos. As the astronauts venture deeper into space, they encounter a series of challenges and obstacles, including hostile environments, dangerous cosmic phenomena, and encounters with alien civilizations. Along the way, they must rely on their ingenuity, courage, and teamwork to navigate the unknown and unravel the mysteries of the nebula. With its blend of adventure, suspense, and philosophical inquiry, 'Project Nebula' offers a captivating reading experience that will appeal to fans of science fiction and anyone with a sense of wonder about the universe and our place within it.",
        "num_of_page": "120",
        "publisher": "2004"
    },
    {
        "id":"09",
        "books_image":"https://i.ibb.co/CncmPDs/download-21.jpg",
        "books_name":"The Decline and Fall of the Roman Empire",
        "author_name":"Edward Gibbon",
        "category":"History",
        "Rating":"8.5/10",
        "details":"The Decline and Fall of the Roman Empire is a monumental historical work written by Edward Gibbon. Originally published in six volumes between 1776 and 1788, Gibbon's magnum opus remains one of the most influential and widely read works of history ever written. The book offers a comprehensive and meticulously researched account of the decline and fall of the Roman Empire, covering a vast sweep of history from the height of the Roman Empire in the 2nd century AD to the fall of Constantinople in 1453. Gibbon's narrative spans centuries and continents, examining the political, military, economic, and cultural factors that contributed to the collapse of one of the greatest civilizations in history. Gibbon's prose is elegant, erudite, and deeply insightful, as he traces the complex interplay of events and forces that shaped the destiny of Rome and its empire. He explores the internal decay of the Roman state, including corruption, decadence, and political infighting, as well as external threats from barbarian invasions, religious conflicts, and the rise of rival powers.",
        "num_of_page": "355",
        "publisher": "1995"
    },
    {
        "id":"10",
        "books_image":"https://i.ibb.co/D9Lv9hV/download-22.jpg","books_name":"Mohakashe Mohatrash",
        "author_name":"Mohammad Jafor Iqbal",
        "category":"Sci-Fi",
        "Rating":"8/10",
        "details":"Mohakashe Mohatrash is a science fiction novel written by the renowned Bangladeshi author, Muhammed Zafar Iqbal. In this gripping tale, Iqbal takes readers on a thrilling journey through the cosmos, exploring the wonders and dangers of space travel. The story follows the adventures of a group of intrepid astronauts who embark on a groundbreaking mission to explore the mysteries of outer space. Led by a visionary scientist, the crew faces numerous challenges and encounters as they venture into the vast expanse of the universe. As they journey deeper into the cosmos, the crew discovers awe-inspiring celestial phenomena, encounters enigmatic extraterrestrial beings, and confronts the harsh realities of space exploration. From navigating treacherous asteroid fields to unraveling the secrets of distant planets, the crew must rely on their courage, ingenuity, and teamwork to overcome the obstacles that stand in their way.",
        "num_of_page": "164",
        "publisher": "2001"
    }
]